## **[MySQL ON DELETE CASCADE](https://www.mysqltutorial.org/mysql-on-delete-cascade/)**

Delete data from child tables automatically when you delete the data from the parent table

In [1]:
import pandas as pd
import numpy as np
import re
import matplotlib.pyplot as plt
import matplotlib.image as mpimg
from IPython.display import Image, SVG

from sqlalchemy_utils import database_exists, create_database
from sqlalchemy import create_engine, inspect, MetaData, text
from sqlalchemy_schemadisplay import create_schema_graph
import pymysql

pd.set_option(
    'display.max_columns', None,
    'expand_frame_repr', True,
    'display.max_colwidth', None,
    'display.max_rows', 10,
)

pd.set_option('display.width', 65)

In [2]:
# connect to the classicmodels database
connect_args={'ssl':{'fake_flag_to_enable_tls': True}}

engine = create_engine('mysql+pymysql://namlq:abc123@localhost/classicmodels',
                       connect_args=connect_args, echo=False
                         )
inspector = inspect(engine)

### MySQL ON DELETE CASCADE example

In [3]:
# delete the existed table (if any):
engine.execute('DROP TABLE IF EXISTS buildings, rooms')

# create the buildings table:
string = '''
CREATE TABLE buildings (
    building_no INT PRIMARY KEY AUTO_INCREMENT,
    building_name VARCHAR(255) NOT NULL,
    address VARCHAR(255) NOT NULL)
;'''

engine.execute(string)

# create the rooms table:
string = '''
CREATE TABLE rooms (
    room_no INT PRIMARY KEY AUTO_INCREMENT,
    room_name VARCHAR(255) NOT NULL,
    building_no INT NOT NULL,
    FOREIGN KEY (building_no) 
        REFERENCES buildings (building_no)
        ON DELETE CASCADE
); '''

engine.execute(string)

# insert rows into the buildings table:
string = '''
INSERT INTO buildings(building_name, address)
VALUES ('ACME Headquaters', '3950 North 1st Street CA 95134'),
       ('ACME Sales', '5000 North 1st Street CA 95134')
;'''

engine.execute(string)

# insert rows into the rooms table:
string = '''
INSERT INTO rooms(room_name, building_no)
VALUES ('Amazon', 1), ('War Room', 1), ('Office of CEO', 1),
       ('Marketing', 2), ('Showroom', 2)
;'''

engine.execute(string)

/tmp/ipykernel_7756/3111580915.py:2: RemovedIn20Warning: Deprecated API features detected! These feature(s) are not compatible with SQLAlchemy 2.0. To prevent incompatible upgrades prior to updating applications, ensure requirements files are pinned to "sqlalchemy<2.0". Set environment variable SQLALCHEMY_WARN_20=1 to show all deprecation warnings.  Set environment variable SQLALCHEMY_SILENCE_UBER_WARNING=1 to silence this message. (Background on SQLAlchemy 2.0 at: https://sqlalche.me/e/b8d9)
  engine.execute('DROP TABLE IF EXISTS buildings, rooms')

In [4]:
# query the data from the buildings table:
buildings = pd.read_sql('SELECT * FROM buildings', engine)
buildings

,building_no,building_name,address
0,1,ACME Headquaters,3950 North 1st Street CA 95134
1,2,ACME Sales,5000 North 1st Street CA 95134

In [5]:
# query the data from the rooms table:
rooms = pd.read_sql('SELECT * FROM rooms', engine)
rooms

   room_no      room_name  building_no
0        1         Amazon            1
1        2       War Room            1
2        3  Office of CEO            1
3        4      Marketing            2
4        5       Showroom            2

In [6]:
# Delete the building with building no. 2:
string = '''
DELETE FROM buildings
WHERE building_no = 2
;'''

engine.execute(string)

In [7]:
# query data from buildings table:
pd.read_sql('SELECT * FROM buildings', engine)

,building_no,building_name,address
0,1,ACME Headquaters,3950 North 1st Street CA 95134

In [8]:
# query data from rooms table:
pd.read_sql('SELECT * FROM rooms', engine)

   room_no      room_name  building_no
0        1         Amazon            1
1        2       War Room            1
2        3  Office of CEO            1

Pandas codes:

In [9]:
buildings = buildings.query('building_no != 2')

building_remain = set(buildings.building_no)

rooms = rooms.query('building_no in @building_remain')
rooms

   room_no      room_name  building_no
0        1         Amazon            1
1        2       War Room            1
2        3  Office of CEO            1

### Tips to find tables affected by MySQL ON DELETE CASCADE action

Query this data from the referential_constraints in the information_schema database as follows:

USE information_schema;

SELECT 
    table_name
FROM
    referential_constraints
WHERE
    constraint_schema = 'database_name'
        AND referenced_table_name = 'parent_table'
        AND delete_rule = 'CASCADE'

In [10]:
connect_args={'ssl':{'fake_flag_to_enable_tls': True}}

engine = create_engine('mysql+pymysql://namlq:abc123@localhost/information_schema',
                       connect_args=connect_args, echo=False)

string = '''
SELECT table_name
FROM referential_constraints
WHERE constraint_schema = 'classicmodels'
    AND referenced_table_name = 'buildings'
    AND delete_rule = 'CASCADE'
;'''

pd.read_sql(string, engine)

  TABLE_NAME
0      rooms

In [11]:
connect_args={'ssl':{'fake_flag_to_enable_tls': True}}
engine = create_engine('mysql+pymysql://namlq:abc123@localhost/classicmodels',
                       connect_args=connect_args, echo=False)

engine.execute('DROP TABLE IF EXISTS buildings, rooms')